ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_Чат/ЖБИ_Чат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_Чат</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ceef4a2-6b58-45a0-8a75-bb6e3004590f">
  <name>ЗаказКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="2261fcc3-938d-4df2-a64b-de5601c36355">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37cf8891-f7e5-4223-a4fe-8aa0212b88aa">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b6951ae3-bd6b-4547-a0ed-f8cb252badb3">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d68151c-a9dd-450f-8139-3be6ac926f58">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c683aebd-f890-44bb-bbe3-b67f7e95b55b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9b03f67d-2b7d-4c73-a988-943a154dbef7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="75bf369d-e0ba-4ded-a392-7292f757e439">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a58e515c-907f-4bc5-9df7-29265a46385b">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖБИ_НомерСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ДатаСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ПодписантПоставщик</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ПодписантПокупатель</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре1</name>
    <comment>Расчеты между сторонами</comment>
    <type>
      <types>CatalogRef.ЖБИ_УсловияПоОплатеВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре2</name>
    <comment>Сроки отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_СрокиОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре3</name>
    <comment>Дополнение</comment>
    <type>
      <types>CatalogRef.ЖБИ_Дополнение</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="7b526229-3286-418a-920a-ff15a9b3ec48">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ffeb3fd7-4078-4908-9b27-a77155e26744">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5c903d97-280f-4725-81a1-6c46aa3d2e39">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="da473af6-1960-4683-b941-b8e3988be4fb">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4bca1976-4244-47db-9333-d6f0a0945532">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9106ea63-39cc-454e-b34b-dcf8dc95d2e4">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ea68fa0a-5188-4f2e-b04a-9834dbc8adaa">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5226ecfa-b7f0-488a-95ed-b0f2cd61995b">
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e138baa-2bf3-4a9e-ad92-f5cc8efb2419">
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c9795939-b692-409f-8dc0-52a5aca1dcb1">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5eb4aad6-5fc3-48f5-be2f-9045d3962e18">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="08f0de4b-9d83-4a4f-ac8b-79abaeef3771">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4ee7b1a1-d03a-410e-bd5e-a77a57f5c3ef">
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1073bd55-a7ac-4f25-b80a-94c9c106572d">
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a5a61688-4574-483f-9ddf-f2cfea450a8d">
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d63279c9-8cd6-4554-b887-089667be2e17">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b8b4deae-e12e-4990-b93f-59708fe5f787">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="783d4bd3-4cbe-4dea-8aca-c1cf630dd371">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="56ee214a-9ba3-4066-89e9-3b53a7af29bc">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a0952e09-6f01-42b1-a300-c940c3316f7f">
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0883a58c-2cb3-470f-9ab2-dcd4c1f54b3d">
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЖБИ_НоменклатураПоставщика</name>
      <comment>Номенклатура поставщика</comment>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="9f879343-e818-451b-aa4c-fd188e373135">
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8bd9f000-83c9-4a48-8166-2691b6f02183">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e6b39f22-3d0b-4d48-8610-f5b36bbaebc8">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="10699bb8-b685-49df-b889-e56f9cb3a64d">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d121ce6-6d64-46b8-994d-69e60ed91a43">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="595aeccc-8e6d-4e20-a5fd-69789d5828b2">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06fbccda-70c8-41aa-84e7-f19b55ac0e9c">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79cb27a7-2b14-4398-bf17-b88ef2c2a649">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="78c21b30-8148-410f-91b7-6ee155fd8c63">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖБИ_ДокументОснование</name>
    <comment>ЖБИ - Документ основание</comment>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_НомерСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ДатаСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре1</name>
    <comment>Расчеты между сторонами</comment>
    <type>
      <types>CatalogRef.ЖБИ_УсловияПоОплатеВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре2</name>
    <comment>Срок производства</comment>
    <type>
      <types>CatalogRef.ЖБИ_УсловияПоОплатеВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре3</name>
    <comment>Доставка</comment>
    <type>
      <types>CatalogRef.ЖБИ_УсловияПоОплатеВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре4</name>
    <comment>Условия расчета между сторонами</comment>
    <type>
      <types>CatalogRef.ЖБИ_УсловияПоОплатеВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре5</name>
    <comment>Дополнение</comment>
    <type>
      <types>CatalogRef.ЖБИ_Дополнение</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ПодписантПоставщик</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ПодписантПокупатель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="dcee393b-d797-4bfd-be64-3bc288149128">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="fb7178d5-075f-4bff-bd5e-69dd3c98eeb0">
      <name>НоменклатураПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8a5b2ff1-9253-46ce-be3f-1ffa9c7e158e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dcfc241-72d7-4f32-8087-92a6267c3254">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЖБИ_ПередачаВОтгрузку</name>
      <type>
        <types>DocumentRef.ЖБИ_ПередачаВОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>ЖБИ_ЦенаПоставщика</name>
      <comment>Цена просчета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЖБИ_Сумма</name>
      <comment>Сумма просчета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="01cc7512-0c6d-46a0-aeb6-5134fe2c51c8">
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/CommonModules/УправлениеСвойствами/Module.bsl
Процедура ЗаполнитьЧатЗаявкиПокупателей(Форма) Экспорт
	
	Объект = Форма.Объект.Ссылка;
	Если Объект.Ссылка.Пустая() Тогда 
		Возврат;
	КонецЕсли;
	
	ТексЗапроса = "ВЫБРАТЬ
	              |	ЖБИ_Чат.Период КАК Дата,
	              |	ЖБИ_Чат.Ответственный КАК Ответственный,
	              |	ЖБИ_Чат.Комментарий КАК Комментарий
	              |ИЗ
	              |	РегистрСведений.ЖБИ_Чат КАК ЖБИ_Чат
	              |ГДЕ
	              |	ЖБИ_Чат.Объект = &Объект"; 
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Дата");
	МассивКолонок.Добавить("Ответственный");
	МассивКолонок.Добавить("Комментарий");

	ИмяДинСписка 			= "Чат";
	СвояКоманднаяПанель 	= Истина;
	ДобавитьВ 				= "ГруппаЧат";
	СписокПараметров 		= Новый Структура("Объект",Объект);
	ЖБИ_ОбщийМодульКлиентСервер.СозданиеДинамическогоСписка(Форма,ИмяДинСписка,ТексЗапроса,МассивКолонок,,,ДобавитьВ,,СвояКоманднаяПанель,СписокПараметров);	
	
КонецПроцедуры

Процедура ЗаполнитьЧатРасчетПлановыхСтавок(Форма)
	
	Объект = Форма.Объект.Ссылка.ДокументОснование;
	ТексЗапроса = "ВЫБРАТЬ
	              |	ЖБИ_Чат.Период КАК Дата,
	              |	ЖБИ_Чат.Ответственный КАК Ответственный,
	              |	ЖБИ_Чат.Комментарий КАК Комментарий
	              |ИЗ
	              |	РегистрСведений.ЖБИ_Чат КАК ЖБИ_Чат
	              |ГДЕ
	              |	ЖБИ_Чат.Объект = &Объект"; 
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Дата");
	МассивКолонок.Добавить("Ответственный");
	МассивКолонок.Добавить("Комментарий");

	ИмяДинСписка 			= "Чат";
	СвояКоманднаяПанель 	= Истина;
	ДобавитьВ 				= "ГруппаЧат";
	СписокПараметров 		= Новый Структура("Объект",Объект);
	ЖБИ_ОбщийМодульКлиентСервер.СозданиеДинамическогоСписка(Форма,ИмяДинСписка,ТексЗапроса,МассивКолонок,,,ДобавитьВ,,СвояКоманднаяПанель,СписокПараметров);	
	
КонецПроцедуры

Процедура ДобавлениеРеквизитовФормыНоменклатура(Форма, ДополнительныеПараметры)
	
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты = Новый Массив;
	
	// Опишем ревизиты формы	
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_АртикулДляСайта",	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),	, "Артикул для сайта");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ВыгружатьНаСайт",	Новый ОписаниеТипов("Булево"),	, "Выгружать на сайт");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ЕстьСертификатТаможенногоСоюза",	Новый ОписаниеТипов("Булево"),	, "Сертификат таможенного союза");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ЕстьНаСкладе",	Новый ОписаниеТипов("Булево"),	, "Есть на складе");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	
	//Элементы
	Шрифт 	  = Новый Шрифт("MS Shell Dlg", 8, Истина);
	ИмяГруппы = "АртикулКодШтрихкод";
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы <> Неопределено Тогда		
		ИмяЭлемента = "ЖБИ_АртикулДляСайта";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_АртикулДляСайта";			
			ЭлементФормы.ШрифтЗаголовка         = Шрифт;
		КонецЕсли; 
		ИмяЭлемента = "ЖБИ_ВыгружатьНаСайт";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ВыгружатьНаСайт";			
			ЭлементФормы.ШрифтЗаголовка         = Шрифт;
		КонецЕсли;
		ИмяЭлемента = "ЖБИ_ЕстьСертификатТаможенногоСоюза";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ЕстьСертификатТаможенногоСоюза";			
			ЭлементФормы.ШрифтЗаголовка         = Шрифт;
		КонецЕсли;
		ИмяЭлемента = "ЖБИ_ЕстьНаСкладе";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ЕстьНаСкладе";			
			ЭлементФормы.ШрифтЗаголовка         = Шрифт;
		КонецЕсли;
	КонецЕсли;
	
	Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_АртикулДляСайта"], ГруппаФормы, Форма.Элементы.Код);
	Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_ВыгружатьНаСайт"], ГруппаФормы, Форма.Элементы.Код);
	Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_ЕстьНаСкладе"], ГруппаФормы, Форма.Элементы.Код);
	Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_ЕстьСертификатТаможенногоСоюза"], ГруппаФормы, Форма.Элементы.Код);
	
	#КонецОбласти
		
КонецПроцедуры

Процедура ДобавлениеРеквизитовФормыНоменклатураГруппа(Форма, ДополнительныеПараметры)
	
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты = Новый Массив;
	
	// Опишем ревизиты формы	
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ВыгружатьНаСайт",	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),	, "Выгружать на сайт");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_Порядок",	Новый ОписаниеТипов("Число"),	, "Порядок");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ОписаниеГруппы",	Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(512)),	, "Описание группы №1");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ОписаниеГруппы1",	Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(512)),	, "Описание группы №2");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	
	// Элементы
	Шрифт 	  = Новый Шрифт("MS Shell Dlg", 8, Истина);	
	ИмяЭлемента = "ЖБИ_ВыгружатьНаСайт";
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма);        
		ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ВыгружатьНаСайт";			
		ЭлементФормы.ШрифтЗаголовка         = Шрифт;
	КонецЕсли;	
	ИмяЭлемента = "ЖБИ_Порядок";
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма);        
		ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_Порядок";			
		ЭлементФормы.ШрифтЗаголовка         = Шрифт;
	КонецЕсли;
	ИмяЭлемента = "ЖБИ_ОписаниеГруппы";
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма);        
		ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ОписаниеГруппы";			
		ЭлементФормы.ШрифтЗаголовка         = Шрифт;
		ЭлементФормы.АвтоМаксимальнаяШирина	= Ложь;
		ЭлементФормы.МногострочныйРежим		= Истина;
	КонецЕсли;
	ИмяЭлемента = "ЖБИ_ОписаниеГруппы1";
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма);        
		ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ОписаниеГруппы1";			
		ЭлементФормы.ШрифтЗаголовка         = Шрифт;
		ЭлементФормы.АвтоМаксимальнаяШирина	= Ложь;
		ЭлементФормы.МногострочныйРежим		= Истина;
	КонецЕсли
	#КонецОбласти
		
КонецПроцедуры

Процедура ДобавлениеРеквизитовФормыДоговорыКонтрагентов(Форма, ДополнительныеПараметры)
	
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы	
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ПодписантОрганизация",	Новый ОписаниеТипов("СправочникСсылка.ОтветственныеЛицаОрганизаций"),	, "Подписант");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ОснованиеСоСтороныОрганизации", Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(128)),	, "На основании со стороны Организации");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ПодписантКонтрагент",	Новый ОписаниеТипов("СправочникСсылка.ЖБИ_Должности"),	, "Подписант");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ОснованиеСоСтороныКонтрагента", Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(128)),	, "На основании со стороны продавца/покупателя");
		
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	
	// Элементы
	Шрифт 	  = Новый Шрифт("MS Shell Dlg", 8, Истина);
	ИмяГруппы = "ГруппаОрганизация";
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы <> Неопределено Тогда		
		ИмяЭлемента = "ЖБИ_ПодписантОрганизация";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ПодписантОрганизация";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина 	= 29;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;			
			ЭлементФормы.ШрифтЗаголовка         = Шрифт;
		КонецЕсли; 
		
		ИмяЭлемента = "ЖБИ_ОснованиеСоСтороныОрганизации";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ОснованиеСоСтороныОрганизации";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина 	= 29;
			ЭлементФормы.КнопкаОчистки 			= Истина;
			ЭлементФормы.ШрифтЗаголовка         = Шрифт;
		КонецЕсли;	
	КонецЕсли;
	
	// Элементы
	ИмяГруппы = "ГруппаПартнерКонтрагент";
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы <> Неопределено Тогда
		
		ИмяЭлемента = "ЖБИ_ПодписантКонтрагент";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ПодписантКонтрагент";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина 	= 29;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
			ЭлементФормы.ШрифтЗаголовка         = Шрифт;
		КонецЕсли; 
		
		ИмяЭлемента = "ЖБИ_ОснованиеСоСтороныКонтрагента";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ОснованиеСоСтороныКонтрагента";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина 	= 29;
			ЭлементФормы.КнопкаОчистки 			= Истина;
			ЭлементФормы.ШрифтЗаголовка         = Шрифт;
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
		
КонецПроцедуры

Процедура ДобавлениеРеквизитовФормыКонтактныеЛицаПартнеров(Форма, ДополнительныеПараметры)
	
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_Должность", Новый ОписаниеТипов("СправочникСсылка.ЖБИ_Должности"),	, "Должность");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_Главный", Новый ОписаниеТипов("Булево"),	, "Основная должность для переговоров");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	// Элементы
	ИмяГруппы = "ГруппаОсновныеСведения";
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы <> Неопределено Тогда
		
		ИмяЭлемента = "ЖБИ_Должность";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_Должность";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина		= 65;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
			ЭлементФормы.УстановитьДействие("ПриИзменении", "ПриИзмененииЖБИ_Должность");
		КонецЕсли;
		Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_Должность"], ГруппаФормы, Форма.Элементы.ДолжностьПоВизитке);
		
		ИмяЭлемента = "ЖБИ_Главный";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеФлажка;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_Главный";
		КонецЕсли;
		Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_Главный"], ГруппаФормы, Форма.Элементы.ЖБИ_Должность);
	КонецЕсли;
	#КонецОбласти

КонецПроцедуры

Процедура ДобавлениеРеквизитовФормыТранспортныеСредства(Форма, ДополнительныеПараметры)
	
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_МаркаПрицепа", Новый ОписаниеТипов("СправочникСсылка.ЖБИ_МаркаПрицепа"),	, "Марка прицепа");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	// Элементы
	ИмяГруппы = "ГруппаПрицеп";
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы <> Неопределено Тогда		
		ИмяЭлемента = "ЖБИ_МаркаПрицепа";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_МаркаПрицепа";
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
		Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_МаркаПрицепа"], ГруппаФормы, Форма.Элементы.Прицеп);
	КонецЕсли;
	#КонецОбласти

КонецПроцедуры

Процедура ДобавлениеРеквизитовФормыПользователи(Форма, ДополнительныеПараметры)
	
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ЭлектроннаяПодписьПользователя", Новый ОписаниеТипов("СправочникСсылка.ЖБИ_ЭлектронныеПодписиПользователей"),	, "Элетронная подпись");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	//Страница
	ИмяГруппы = "СтраницаПерсональныеНастройки";
	СтраницаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если СтраницаФормы = Неопределено Тогда 
		НовыйЭлементСтраница 				= Форма.Элементы.Добавить("СтраницаПерсональныеНастройки",Тип("ГруппаФормы"),Форма.Элементы.Страницы);
		НовыйЭлементСтраница.Вид 			= ВидГруппыФормы.Страница;
		НовыйЭлементСтраница.Заголовок 		= "Персональные настройки";
		СтраницаФормы 						= НовыйЭлементСтраница;
	КонецЕсли;
	// Элементы
	ИмяГруппы = "СтраницаПерсональныеНастройки";
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы <> Неопределено Тогда		
		ИмяЭлемента = "ЖБИ_ЭлектроннаяПодписьПользователя";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ЭлектроннаяПодписьПользователя";
			ЭлементФормы.Заголовок				= "Подпись для исходящей почты";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
	 КонецЕсли
	#КонецОбласти

КонецПроцедуры

Процедура ДобавлениеРеквизитовФормыОтветственныеЛицаОрганизаций(Форма, ДополнительныеПараметры)
	
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ФаксимилеПользователя", Новый ОписаниеТипов("СправочникСсылка.ЖБИ_ФаксимилеПользователей"),	, "Факсимиле");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	// Элементы
	ГруппаФормы = Форма;
	Если ГруппаФормы <> Неопределено Тогда		
		ИмяЭлемента = "ЖБИ_ФаксимилеПользователя";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ФаксимилеПользователя";
			ЭлементФормы.Заголовок				= "Факсимиле";
			//ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 20;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
	 КонецЕсли
	#КонецОбласти

КонецПроцедуры

Процедура ДобавлениеРеквизитовФормыЗаказКлиента(Форма, ДополнительныеПараметры)
	
	//Страница
	ИмяГруппы = "СтраницаСпецификация";
	СтраницаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если СтраницаФормы = Неопределено Тогда 
		НовыйЭлементСтраница 				= Форма.Элементы.Добавить("СтраницаСпецификация",Тип("ГруппаФормы"),Форма.Элементы.ГруппаСтраницы);
		НовыйЭлементСтраница.Вид 			= ВидГруппыФормы.Страница;
		НовыйЭлементСтраница.Заголовок 		= "Спецификация";
		СтраницаФормы 						= НовыйЭлементСтраница;
	КонецЕсли;
	
	#Область ЖБИ_УсловиеВДоговоре
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_НомерСпецификации",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10)),,"№ спецификации");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ДатаСпецификации",Новый ОписаниеТипов("Дата"),,"Дата спецификации");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);	
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ПодписантПоставщик",Новый ОписаниеТипов("СправочникСсылка.ОтветственныеЛицаОрганизаций"),,"Подписант поставщик");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);	
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ПодписантПокупатель",Новый ОписаниеТипов("СправочникСсылка.КонтактныеЛицаПартнеров"),,"Подписант покупатель");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
		ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_УсловиеВДоговоре1",Новый ОписаниеТипов("СправочникСсылка.ЖБИ_УсловияПоОплатеВДоговоре"),,"Расчеты между сторонами");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);	
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_УсловиеВДоговоре2",Новый ОписаниеТипов("СправочникСсылка.ЖБИ_СрокиОтгрузки"),,"Сроки отгрузки");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_УсловиеВДоговоре3",Новый ОписаниеТипов("СправочникСсылка.ЖБИ_Дополнение"),,"Дополнение");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
		
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	// Элементы
	ИмяГруппы = "СтраницаСпецификация";
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы <> Неопределено Тогда		
		ИмяЭлемента = "ЖБИ_НомерСпецификации";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_НомерСпецификации";
			ЭлементФормы.Заголовок				= "№ спецификации";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;		
		ИмяЭлемента = "ЖБИ_ДатаСпецификации";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ДатаСпецификации";
			ЭлементФормы.Заголовок				= "Дата спецификации";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
		ИмяЭлемента = "ЖБИ_УсловиеВДоговоре1";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_УсловиеВДоговоре1";
			ЭлементФормы.Заголовок				= "1. Расчеты между сторонами";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли; 	
		ИмяЭлемента = "ЖБИ_УсловиеВДоговоре2";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_УсловиеВДоговоре2";
			ЭлементФормы.Заголовок				= "2. Сроки отгрузки";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
		ИмяЭлемента = "ЖБИ_УсловиеВДоговоре3";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_УсловиеВДоговоре3";
			ЭлементФормы.Заголовок				= "3. Дополнение";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
		ИмяЭлемента = "ЖБИ_ПодписантПоставщик";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ПодписантПоставщик";
			ЭлементФормы.Заголовок				= "Подписант поставщик";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;		
		ИмяЭлемента = "ЖБИ_ПодписантПокупатель";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ПодписантПокупатель";
			ЭлементФормы.Заголовок				= "Подписант покупатель";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;					
	КонецЕсли;
	#КонецОбласти
	
		
	#Область ЖБИ_НоменклатураПоставщика
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_НоменклатураПоставщика",Новый ОписаниеТипов("СправочникСсылка.НоменклатураПоставщиков"),,"Номенклатура поставщика");
	
	// Заполним массив после описания реквизитов формы
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	ИмяЭлемента  				= "ЖБИ_НоменклатураПоставщика";
	ЭлементФормы 				= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.Товары); 
	ЭлементФормы.Вид 			= ВидПоляФормы.ПолеВвода; 
	ЭлементФормы.ПутьКДанным 	= "Объект.Товары.ЖБИ_НоменклатураПоставщика";
	ЭлементФормы.ТолькоПросмотр = Истина;
	
	Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_НоменклатураПоставщика"], Форма.Элементы.Товары, Форма.Элементы.ТоварыНоменклатура);
	#КонецОбласти	
	
	#КонецОбласти
	
	#Область БизнесРегион
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("БизнесРегион",Новый ОписаниеТипов("СправочникСсылка.БизнесРегионы"),,"Бизнес-регион");
	
	// Заполним массив после описания реквизитов формы
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	ИмяЭлемента  				= "БизнесРегион";
	ЭлементФормы 				= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.Товары); 
	ЭлементФормы.Вид 			= ВидПоляФормы.ПолеВвода; 
	ЭлементФормы.ПутьКДанным 	= "Объект.Товары.ЖБИ_НоменклатураПоставщика.Владелец.БизнесРегион";
	ЭлементФормы.ТолькоПросмотр = Истина;
	
	Форма.Элементы.Переместить(Форма.Элементы["БизнесРегион"], Форма.Элементы.Товары, Форма.Элементы.ЖБИ_НоменклатураПоставщика);
	#КонецОбласти	
	
	#КонецОбласти
	
	#Область Поставшик
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("Поставшик",Новый ОписаниеТипов("СправочникСсылка.Партнеры"),,"Поставшик");
	
	// Заполним массив после описания реквизитов формы
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	ИмяЭлемента  				= "Поставшик";
	ЭлементФормы 				= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.Товары); 
	ЭлементФормы.Вид 			= ВидПоляФормы.ПолеВвода; 
	ЭлементФормы.ПутьКДанным 	= "Объект.Товары.ЖБИ_НоменклатураПоставщика.Владелец";
	ЭлементФормы.ТолькоПросмотр = Истина;
	
	Форма.Элементы.Переместить(Форма.Элементы["Поставшик"], Форма.Элементы.Товары, Форма.Элементы.ЖБИ_НоменклатураПоставщика);
	#КонецОбласти
	
	#КонецОбласти
	
	//#Область ЦенаСоСкидкой
	//#Область ДобавлениеРеквизитовФормы
	//// Массив для новых реквизитов
	//ДобавляемыеРеквизиты	= Новый Массив;
	//
	//// Опишем ревизиты формы
	//ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ЦенаСоСкидкой",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)),,"Цена со скидкой");
	//
	//// Заполним массив после описания реквизитов формы
	//ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	//
	//// Добавим новые реквизиты в форму
	//Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	//#КонецОбласти
	//
	//#Область ДобавлениеЭлементовФормы
	//ИмяЭлемента  				= "ЖБИ_ЦенаСоСкидкой";
	//ЭлементФормы 				= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.Товары); 
	//ЭлементФормы.Вид 			= ВидПоляФормы.ПолеВвода;
	//ЭлементФормы.ПутьКДанным 	= "Объект.Товары.ЖБИ_ЦенаСоСкидкой";
	////ЭлементФормы.ТолькоПросмотр = Истина;
	//
	//Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_ЦенаСоСкидкой"], Форма.Элементы.Товары, Форма.Элементы.ТоварыЦена);
	//
	//ЭлементФормы.УстановитьДействие("ПриИзменении", "ВыполнитьДействиеПриИзмененииЦенаСоСкидкой");
	//
	//#КонецОбласти
	//
	//#КонецОбласти
	//
	//#Область ЦенаБазовая
	//#Область ДобавлениеРеквизитовФормы
	//// Массив для новых реквизитов
	//ДобавляемыеРеквизиты	= Новый Массив;
	//
	//// Опишем ревизиты формы
	//ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ЦенаБазовая",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)),,"Цена базовая");
	//
	//// Заполним массив после описания реквизитов формы
	//ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	//
	//// Добавим новые реквизиты в форму
	//Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	//#КонецОбласти
	//
	//#Область ДобавлениеЭлементовФормы
	//ИмяЭлемента  				= "ЖБИ_ЦенаБазовая";
	//ЭлементФормы 				= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.Товары); 
	//ЭлементФормы.Вид 			= ВидПоляФормы.ПолеВвода;
	//ЭлементФормы.ПутьКДанным 	= "Объект.Товары.ЖБИ_ЦенаБазовая";
	////ЭлементФормы.ТолькоПросмотр = Истина;
	//
	//Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_ЦенаБазовая"], Форма.Элементы.Товары, Форма.Элементы.ТоварыЦена);
	//
	//#КонецОбласти
	//
	//#КонецОбласти
	
	#Область Артикул
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("Артикул",	Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(50)), , "Артикул");
	
	// Заполним массив после описания реквизитов формы
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	ИмяЭлемента  				= "Артикул";
	ЭлементФормы 				= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.Товары); 
	ЭлементФормы.Вид 			= ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным 	= "Объект.Товары.Номенклатура.Артикул";
	ЭлементФормы.ТолькоПросмотр = Истина;
	
	Форма.Элементы.Переместить(Форма.Элементы["Артикул"], Форма.Элементы.Товары, Форма.Элементы.БизнесРегион);
	
	#КонецОбласти
	
	#КонецОбласти
	
	Форма.Элементы.Товары.ТолькоПросмотр = Истина;
	
КонецПроцедуры

Процедура ДобавлениеРеквизитовФормыЗаказПоставщику(Форма, ДополнительныеПараметры)
	
	#Область ЖБИ_ЦенаПоставщика
	
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	//Страница
	ИмяГруппы = "СтраницаСпецификация";
	СтраницаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если СтраницаФормы = Неопределено Тогда 
		НовыйЭлементСтраница 				= Форма.Элементы.Добавить("СтраницаСпецификация",Тип("ГруппаФормы"),Форма.Элементы.ГруппаСтраницы);
		НовыйЭлементСтраница.Вид 			= ВидГруппыФормы.Страница;
		НовыйЭлементСтраница.Заголовок 		= "Спецификация";
		СтраницаФормы 						= НовыйЭлементСтраница;
	КонецЕсли;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_НомерСпецификации",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10)),,"№ спецификации");	
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ДатаСпецификации",Новый ОписаниеТипов("Дата"),,"Дата спецификации");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_УсловиеВДоговоре1",Новый ОписаниеТипов("СправочникСсылка.ЖБИ_УсловияПоОплатеВДоговоре"),,"");	
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_УсловиеВДоговоре2",Новый ОписаниеТипов("СправочникСсылка.ЖБИ_УсловияПоОплатеВДоговоре"),,"");	
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_УсловиеВДоговоре3",Новый ОписаниеТипов("СправочникСсылка.ЖБИ_УсловияПоОплатеВДоговоре"),,"");	
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	//ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_УсловиеВДоговоре4",Новый ОписаниеТипов("СправочникСсылка.ЖБИ_УсловияПоОплатеВДоговоре"),,"");	
	//ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_УсловиеВДоговоре5",Новый ОписаниеТипов("СправочникСсылка.ЖБИ_Дополнение"),,"");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ПодписантПоставщик",Новый ОписаниеТипов("СправочникСсылка.КонтактныеЛицаПартнеров"),,"Подписант поставщик");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);	
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ПодписантПокупатель",Новый ОписаниеТипов("СправочникСсылка.ОтветственныеЛицаОрганизаций"),,"Подписант покупатель");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);

	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ЦенаПоставщика",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)),,"Цена просчета");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	
	// Элементы
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаФормы <> Неопределено Тогда	
		ИмяЭлемента = "ЖБИ_НомерСпецификации";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_НомерСпецификации";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
		ИмяЭлемента = "ЖБИ_ДатаСпецификации";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ДатаСпецификации";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
		ИмяЭлемента = "ЖБИ_УсловиеВДоговоре1";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_УсловиеВДоговоре1";
			ЭлементФормы.Заголовок				= "2. Расчеты между сторонами";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли; 
		ИмяЭлемента = "ЖБИ_УсловиеВДоговоре2";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_УсловиеВДоговоре2";
			ЭлементФормы.Заголовок				= "3. Срок производства";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
		ИмяЭлемента = "ЖБИ_УсловиеВДоговоре3";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_УсловиеВДоговоре3";
			ЭлементФормы.Заголовок				= "4. Доставка";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
		//ИмяЭлемента = "ЖБИ_УсловиеВДоговоре4";
		//Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		//	ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
		//	ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
		//	ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_УсловиеВДоговоре4";
		//	ЭлементФормы.Заголовок				= "4. Условия расчета между сторонами";
		//	ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
		//	ЭлементФормы.МаксимальнаяШирина  	= 28;
		//	ЭлементФормы.КнопкаОткрытия 		= Истина;
		//	ЭлементФормы.КнопкаОчистки 			= Истина;
		//КонецЕсли;
		ИмяЭлемента = "ЖБИ_УсловиеВДоговоре5";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_УсловиеВДоговоре5";
			ЭлементФормы.Заголовок				= "5. Дополнение";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
		ИмяЭлемента = "ЖБИ_ПодписантПоставщик";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ПодписантПоставщик";
			ЭлементФормы.Заголовок				= "Подписант поставщик";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;		
		ИмяЭлемента = "ЖБИ_ПодписантПокупатель";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
			ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
			ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ПодписантПокупатель";
			ЭлементФормы.Заголовок				= "Подписант покупатель";
			ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
			ЭлементФормы.МаксимальнаяШирина  	= 28;
			ЭлементФормы.КнопкаОткрытия 		= Истина;
			ЭлементФормы.КнопкаОчистки 			= Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИмяЭлемента = "ЖБИ_ЦенаПоставщика";
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		ЭлементФормы 				= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);         
		ЭлементФормы.Вид 			= ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным 	= "Объект.Товары.ЖБИ_ЦенаПоставщика";
		ЭлементФормы.ТолькоПросмотр = Истина;
	КонецЕсли;	
	Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_ЦенаПоставщика"], Форма.Элементы.Товары, Форма.Элементы.ТоварыЦена);
	
	#КонецОбласти
	
	#КонецОбласти
	
	#Область ЖБИ_Сумма
	#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_Сумма",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)),,"Сумма просчета");
	
	// Заполним массив после описания реквизитов формы
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	ИмяЭлемента  				= "ЖБИ_Сумма";
	ЭлементФормы 				= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.Товары); 
	ЭлементФормы.Вид 			= ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным 	= "Объект.Товары.ЖБИ_Сумма";
	ЭлементФормы.ТолькоПросмотр = Истина;
	
	Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_Сумма"], Форма.Элементы.Товары, Форма.Элементы.ТоварыЦена);
	#КонецОбласти
	
	#КонецОбласти
	
	Форма.Элементы.Товары.Подвал = Истина;
	Форма.Элементы["ЖБИ_Сумма"].ПутьКДаннымПодвала = "Объект.Товары.ИтогЖБИ_Сумма";
	
	#Область СуммаРазница
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_СуммаРазница",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)),,"Разница между ценами");
	
	// Заполним массив после описания реквизитов формы
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	ИмяЭлемента  				= "ЖБИ_СуммаРазница";
	ЭлементФормы 				= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.Товары); 
	ЭлементФормы.Вид 			= ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным 	= "Объект.Товары.ЖБИ_СуммаРазница";
	ЭлементФормы.ТолькоПросмотр = Истина;
	
	Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_СуммаРазница"], Форма.Элементы.Товары, Форма.Элементы.ТоварыЦена);
	
	Товары 			= Форма.Объект.Товары;
	СуммаРазница 	= 0;
	Для Каждого НомСтр Из Товары Цикл
		НомСтр.ЖБИ_СуммаРазница = НомСтр.Цена - НомСтр.ЖБИ_ЦенаПоставщика;
		СуммаРазница 			= СуммаРазница + НомСтр.ЖБИ_СуммаРазница;
	КонецЦикла;	
	Форма.Элементы.ЖБИ_СуммаРазница.ТекстПодвала = СуммаРазница;
		
	#КонецОбласти
	
	Форма.Элементы.НомерВходящегоДокумента.Заголовок = "Номер счета поставщика";
	
КонецПроцедуры

Процедура ДобавлениеРеквизитовФормыЭлектронноеПисьмоИсходящее(Форма, ДополнительныеПараметры)
	
	 #Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты	= Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("ЖБИ_ШаблонПисьмаТема", Новый ОписаниеТипов("СправочникСсылка.ЖБИ_ШаблонПочтовыхСообщений"),,"Тема письма");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);
	
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	#КонецОбласти
	
	#Область ДобавлениеЭлементовФормы
	Шрифт 	  							= Новый Шрифт("MS Shell Dlg", 8, Истина);
	ИмяЭлемента  						= "ЖБИ_ШаблонПисьмаТема";
	ЭлементФормы 						= Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Форма.Элементы.ГруппаЛево); 
	ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок				= "Тема письма";
	ЭлементФормы.ПутьКДанным 			= "Объект.ЖБИ_ШаблонПисьмаТема";
	ЭлементФормы.ШрифтЗаголовка			= Шрифт;
	ЭлементФормы.АвтоМаксимальнаяШирина = Ложь;
	ЭлементФормы.КнопкаОткрытия 		= Истина;
	ЭлементФормы.КнопкаОчистки 			= Истина;
	ЭлементФормы.УстановитьДействие("ПриИзменении", "ПриИзмененииЖБИ_Тема");
	
	Форма.Элементы.Переместить(Форма.Элементы["ЖБИ_ШаблонПисьмаТема"], Форма.Элементы.ГруппаЛево, Форма.Элементы.Тема);
	#КонецОбласти
		
КонецПроцедуры

Процедура ОбновитьЭлементыФормыИнформацию(Форма, ДополнительныеПараметры)
	
	Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		
		//Форма.Элементы.Товары.ПодчиненныеЭлементы["ЖБИ_ЦенаБазовая"].РедактированиеТекста 	= Ложь;
		//Форма.Элементы.Товары.ПодчиненныеЭлементы["ЖБИ_ЦенаБазовая"].КнопкаВыбора 			= Ложь;
		//Форма.Элементы.Товары.ПодчиненныеЭлементы["ЖБИ_ЦенаБазовая"].КнопкаОткрытия 		= Ложь;
		//Форма.Элементы.Товары.ПодчиненныеЭлементы["ЖБИ_ЦенаБазовая"].КнопкаОчистки 			= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОграниченияРедактированияФормаЭлементаПартнеры(Форма, ДополнительныеПараметры)	
	Форма.Элементы.ОсновнойМенеджер.Доступность = ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_НачальникОтделаСбыта")
												ИЛИ ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_НачальникОтделаЛогистики")
												ИЛИ ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_ОсновнаяРоль"); 
КонецПроцедуры

&После("ПриСозданииНаСервере")
Процедура ЖБИ_ПриСозданииНаСервере(Форма, ДополнительныеПараметры) Экспорт 
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда		
		ДобавлениеРеквизитовФормыНоменклатура(Форма, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаГруппы" Тогда		
		ДобавлениеРеквизитовФормыНоменклатураГруппа(Форма, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда		
		ДобавлениеРеквизитовФормыДоговорыКонтрагентов(Форма, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Справочник.КонтактныеЛицаПартнеров.Форма.ФормаЭлемента" Тогда
		ДобавлениеРеквизитовФормыКонтактныеЛицаПартнеров(Форма, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ТранспортныеСредства.Форма.ФормаЭлемента" Тогда
		ДобавлениеРеквизитовФормыТранспортныеСредства(Форма, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Справочник.Пользователи.Форма.ФормаЭлемента" Тогда
		ДобавлениеРеквизитовФормыПользователи(Форма, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Справочник.Партнеры.Форма.ФормаЭлемента" Тогда
		ДобавитьОграниченияРедактированияФормаЭлементаПартнеры(Форма, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ОтветственныеЛицаОрганизаций.Форма.ФормаЭлемента" Тогда
		ДобавлениеРеквизитовФормыОтветственныеЛицаОрганизаций(Форма, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		ДобавлениеРеквизитовФормыЗаказКлиента(Форма, ДополнительныеПараметры);
		ОбновитьЭлементыФормыИнформацию(Форма, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда
		ДобавлениеРеквизитовФормыЗаказПоставщику(Форма, ДополнительныеПараметры);
		ОбновитьЭлементыФормыИнформацию(Форма, ДополнительныеПараметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЖБИ_ЗаявкиПокупателей.Форма.ФормаДокумента" Тогда
		ЗаполнитьЧатЗаявкиПокупателей(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЖБИ_РасчетПлановыхСтавок.Форма.ФормаДокумента" Тогда
		ЗаполнитьЧатРасчетПлановыхСтавок(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЖБИ_ПодтверждениеПлановыхСтавок.Форма.ФормаДокумента" Тогда
		ЗаполнитьЧатРасчетПлановыхСтавок(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЖБИ_ИндивидуальныеУсловияПоставки.Форма.ФормаДокумента" Тогда
		ЗаполнитьЧатРасчетПлановыхСтавок(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЖБИ_ПередачаВОтгрузку.Форма.ФормаДокумента" Тогда
		ЗаполнитьЧатРасчетПлановыхСтавок(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента" Тогда
		ДобавлениеРеквизитовФормыЭлектронноеПисьмоИсходящее(Форма, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры
